#+FILETAGS: HACKING

* Game Development
  :PROPERTIES:
  :ID:       faa642eb-8002-4af8-a098-2ab4e75b86f1
  :END:
PROPERTIES:
CATEGORY: Games
END:

** SOMEDAY kilobolt android game tutorial
   :PROPERTIES:
   :ID:       95c8b378-9880-4b0a-88ae-ef1789ef0cf5
   :END:
http://www.kilobolt.com/game-development-tutorial.html
[2012-10-22 Mon 18:07]
*** NEXT Find out where I'm up to and make next tasks for each week
    :PROPERTIES:
    :ID:       1299357f-6450-4633-8f67-5706b2334bf5
    :END:
** SOMEDAY java code geeks android game tutorial
[[http://www.javacodegeeks.com/2011/06/android-game-development-tutorials.html][tutorial]] 
  CLOCK: [2012-10-23 Tue 17:06]--[2012-10-23 Tue 17:06] =>  0:00
   :PROPERTIES:
   :ID:       6a9762f7-dd70-4f1f-a09b-eef4151fc4f8
   :END:
[2012-10-23 Tue 17:06]
*** NEXT Java code geeks Tutorial
    :PROPERTIES:
    :ID:       953d8f2c-22b2-40ad-bbde-e2eabc453c60
    :END: 

* Programming
  :PROPERTIES:
  :ID:       5353497c-9613-4623-a4ba-4ac6a37e42fe
  :END:
** Structure and Interpretation of Computer Programs 
http://mitpress.mit.edu/sicp/
http://groups.csail.mit.edu/mac/classes/6.001/abelson-sussman-lectures/
* emacs
  :PROPERTIES:
  :ID:       0dcdccc8-50f8-487d-88c6-1034edc744ef
  :END:
PROPERTIES:
CATEGORY: emacs
END:

** SOMEDAY emdroid hacking
[[http://www.emacswiki.org/emacs/EmDroid][EmDroid]]
  CLOCK: [2012-10-21 Sun 17:23]--[2012-10-21 Sun 17:23] =>  0:00
   :PROPERTIES:
   :ID:       0f28a16d-86ca-4727-b2ca-dc631fe1273f
   :END:
[2012-10-21 Sun 17:23]
** SOMEDAY Configure emacs for email
   :PROPERTIES:
   :ID:       59fb7afd-3134-4ef9-80d6-391b05284663
   :END:
*** NEXT Set up offlineimap
    :PROPERTIES:
    :ID:       8e34b366-070d-4735-bad1-9c8fba262783
    :END:
See:
[[http://docs.offlineimap.org/en/latest/MANUAL.html][http://docs.offlineimap.org/en/latest/MANUAL.html]]
[[http://jak-linux.org/projects/hardlink/]]
[[http://bramschoenmakers.nl/node/713][http://bramschoenmakers.nl/node/713]]
[[https://wiki.archlinux.org/index.php/OfflineIMAP#Gmail_configuration][https://wiki.archlinux.org/index.php/OfflineIMAP#Gmail_configuration]]
[[http://kwlug.org/pipermail/kwlug-disc_kwlug.org/2010-March/004026.html]]
[[http://reddragdiva.dreamwidth.org/567837.html]]
[[http://yet-another-problem.blogspot.com/2012/02/gmail-offlineimap-mutt-msmtp.html]]
**** offlineimap configuration ~/.offlineimaprc
[general]
accounts = GMail
maxsyncaccounts = 3

[Account GMail]
localrepository = Local
remoterepository = Remote

[Repository Local]
type = Maildir
localfolders = ~/Mail

[Repository Remote]
type = Gmail
remoteuser = pabryan@gmail.com
remotepass = Youg2Ltc
maxconnections = 3
folderfilter = lambda folder: folder in ['PTE', 'temp']
realdelete = no


**** muttrc
set mbox_type   = Maildir
set sendmail    = /usr/bin/msmtp

set folder      = ~/Mail
set spoolfile   = "+INBOX"
set mbox        = "+[Gmail]/All Mail"
set postponed   = "+[Gmail]/Drafts"
unset record

mailboxes +INBOX

macro index D \
    "<save-message>+[Gmail]/Trash<enter>" \
    "move message to the trash"

macro index S \
    "<save-message>+[Gmail]/Spam<enter>" \
    "mark message as spam"

# main options
set realname   = "Real Name"
set from       = "user@gmail.com"
set mail_check = 0
set envelope_from

unset move           # gmail does that
set delete           # don't ask, just do
unset confirmappend  # don't ask, just do!
set quit             # don't ask, just do!!
unset mark_old       # read/new is good enough for me

# sort/threading
set sort     = threads
set sort_aux = reverse-last-date-received
set sort_re

# look and feel
set pager_index_lines = 8
set pager_context     = 5
set pager_stop
set menu_scroll
set smart_wrap
set tilde
unset markers

# composing 
set fcc_attach
unset mime_forward
set forward_format = "Fwd: %s"
set include
set forward_quote

ignore *                               # first, ignore all headers
unignore from: to: cc: date: subject:  # then, show only these
hdr_order from: to: cc: date: subject: # and in this order


*** TODO Store passwords in keyring
    :PROPERTIES:
    :ID:       fc03edb7-f209-45db-8414-c0b249b02351
    :END:
[[http://pypi.python.org/pypi/keyring][http://pypi.python.org/pypi/keyring]]
[[http://www.emacswiki.org/emacs/OfflineIMAP][http://www.emacswiki.org/emacs/OfflineIMAP]]

*** TODO Choose emacs email reading/writing method
    :PROPERTIES:
    :ID:       4bc3c470-a7ec-4a15-a78f-3e0e03f33ad6
    :END:

[[http://www.emacswiki.org/emacs/CategoryMail]]
Does mutt integrate well?
[[http://www.emacswiki.org/emacs/MuttInEmacs][http://www.emacswiki.org/emacs/MuttInEmacs]]

** SOMEDAY Implement emacs merge-news for hg
  CLOCK: [2012-10-31 Wed 09:40]--[2012-10-31 Wed 09:40] =>  0:00
   :PROPERTIES:
   :ID:       4fc56c2f-08d8-456b-a8da-66fcfe9d1ec4
   :END:
[2012-10-31 Wed 09:40]
